/**
 * Пакет инструментов для работы с различными форматами данных, связанных
 * с задачей распознавания скрытых последовательностей.
 * 
 * <p>Поддерживаемые форматы файлов:
 * <ul>
 * <li><a href="http://en.wikipedia.org/wiki/GenBank">GenBank</a> — формат описания ДНК.
 * Файлы в этом формате можно получить, например, из Национального центра биоинформатики США 
 * (<a href="http://ncbi.nlm.nih.gov/">NCBI</a>).
 * <li><a href="http://en.wikipedia.org/wiki/DSSP_(protein)">DSSP</a> — формат описания вторичной структуры белков. 
 * Файлы в этом формате можно получить, например, из Европейского центра по молекулярной и биомолекулярной информатике
 * (<a href="ftp://ftp.cmbi.ru.nl/pub/molbio/data/dssp/">CMBI</a>).
 * </ul>
 */
package ua.kiev.icyb.bio.io;